﻿﻿//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//
//  File History
//
//  Rev. 1.01
//    Bug Fix : Fixed that SUM team reported there are two setup items were using 
//              the same mapping language ID, SMCBL03D.
//    Reason  : Bug Fixed.
//    Auditor : Joe Jhang
//    Date    : Apr/12/2017
//
//  Rev. 1.00
//    Bug Fix : N/A.
//    Reason  : Based on Purley_Setup_Mapping_Language_Draft_20170301_Joe.xlsx 
//              and Official_BIOS_SOP_Revised_Draft_20170301_Mapping_Language_Joe.xlsx 
//              to implement HII mapping language for BIOS setting preservation.
//    Auditor : Joe Jhang
//    Date    : Mar/02/2017
//
//****************************************************************************
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2016, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**             6145-F Northbelt Pkwy, Norcross, GA 30071            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:        IioSetupStringsXAmi.uni
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>

#langdef   x-AMI "AmiMappingLanguage"
// Use KTIS29E onwards to add any X-AMI mapping language in this UNI file.

#string STR_IIO_VTD_SUPPORT_PROMPT      #language x-AMI "CSPPL038" //SMCPKG_SUPPORT

#string STR_IIO_VMD_SUPPORT_PROMPT_0      #language x-AMI "SMCBL05F" //SMCPKG_SUPPORT
#string STR_IIO_VMD_SUPPORT_PROMPT_1      #language x-AMI "SMCBL065" //SMCPKG_SUPPORT
#string STR_IIO_VMD_SUPPORT_PROMPT_2      #language x-AMI "SMCBL06B" //SMCPKG_SUPPORT
#string STR_IIO_VMD_SUPPORT_PROMPT_3      #language x-AMI "SMCBL071" //SMCPKG_SUPPORT
#string STR_IIO_VMD_SUPPORT_PROMPT_4      #language x-AMI "SMCBL077" //SMCPKG_SUPPORT
#string STR_IIO_VMD_SUPPORT_PROMPT_5      #language x-AMI "SMCBL07D" //SMCPKG_SUPPORT
#string STR_IIO_VMD_SUPPORT_PROMPT_6      #language x-AMI "IIOS205"
#string STR_IIO_VMD_SUPPORT_PROMPT_7      #language x-AMI "IIOS209"
#string STR_IIO_VMD_SUPPORT_PROMPT_8      #language x-AMI "IIOS20A"
#string STR_IIO_VMD_SUPPORT_PROMPT_9      #language x-AMI "IIOS20B"
#string STR_IIO_VMD_SUPPORT_PROMPT_10     #language x-AMI "IIOS20C"
#string STR_IIO_VMD_SUPPORT_PROMPT_11     #language x-AMI "IIOS20D"

#string STR_VMD_HOTPLUGENABLE_PROMPT_0     #language x-AMI "SMCBL064" //SMCPKG_SUPPORT
#string STR_VMD_HOTPLUGENABLE_PROMPT_1     #language x-AMI "SMCBL06A" //SMCPKG_SUPPORT
#string STR_VMD_HOTPLUGENABLE_PROMPT_2     #language x-AMI "SMCBL070" //SMCPKG_SUPPORT
#string STR_VMD_HOTPLUGENABLE_PROMPT_3     #language x-AMI "SMCBL076" //SMCPKG_SUPPORT
#string STR_VMD_HOTPLUGENABLE_PROMPT_4     #language x-AMI "SMCBL07C" //SMCPKG_SUPPORT
#string STR_VMD_HOTPLUGENABLE_PROMPT_5     #language x-AMI "SMCBL082" //SMCPKG_SUPPORT
#string STR_VMD_HOTPLUGENABLE_PROMPT_6     #language x-AMI "IIOS244"
#string STR_VMD_HOTPLUGENABLE_PROMPT_7     #language x-AMI "IIOS245"
#string STR_VMD_HOTPLUGENABLE_PROMPT_8     #language x-AMI "IIOS246"
#string STR_VMD_HOTPLUGENABLE_PROMPT_9     #language x-AMI "IIOS247"
#string STR_VMD_HOTPLUGENABLE_PROMPT_10    #language x-AMI "IIOS248"
#string STR_VMD_HOTPLUGENABLE_PROMPT_11    #language x-AMI "IIOS249"

#string STR_VMDPORTENABLE_PROMPT_0      #language x-AMI "SMCBL060" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_1      #language x-AMI "SMCBL061" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_2      #language x-AMI "SMCBL062" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_3      #language x-AMI "SMCBL063" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_4      #language x-AMI "SMCBL066" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_5      #language x-AMI "SMCBL067" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_6      #language x-AMI "SMCBL068" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_7      #language x-AMI "SMCBL069" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_8      #language x-AMI "SMCBL06C" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_9      #language x-AMI "SMCBL06D" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_10     #language x-AMI "SMCBL06E" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_11     #language x-AMI "SMCBL06F" //SMCPKG_SUPPORT

#string STR_VMDPORTENABLE_PROMPT_12     #language x-AMI "SMCBL072" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_13     #language x-AMI "SMCBL073" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_14     #language x-AMI "SMCBL074" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_15     #language x-AMI "SMCBL075" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_16     #language x-AMI "SMCBL078" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_17     #language x-AMI "SMCBL079" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_18     #language x-AMI "SMCBL07A" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_19     #language x-AMI "SMCBL07B" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_20     #language x-AMI "SMCBL07E" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_21     #language x-AMI "SMCBL07F" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_22     #language x-AMI "SMCBL080" //SMCPKG_SUPPORT
#string STR_VMDPORTENABLE_PROMPT_23     #language x-AMI "SMCBL081" //SMCPKG_SUPPORT

#string STR_VMDPORTENABLE_PROMPT_24     #language x-AMI "IIOS226"
#string STR_VMDPORTENABLE_PROMPT_25     #language x-AMI "IIOS227"
#string STR_VMDPORTENABLE_PROMPT_26     #language x-AMI "IIOS228"
#string STR_VMDPORTENABLE_PROMPT_27     #language x-AMI "IIOS229"
#string STR_VMDPORTENABLE_PROMPT_28     #language x-AMI "IIOS22A"
#string STR_VMDPORTENABLE_PROMPT_29     #language x-AMI "IIOS22B"
#string STR_VMDPORTENABLE_PROMPT_30     #language x-AMI "IIOS22C"
#string STR_VMDPORTENABLE_PROMPT_31     #language x-AMI "IIOS22D"
#string STR_VMDPORTENABLE_PROMPT_32     #language x-AMI "IIOS22E"
#string STR_VMDPORTENABLE_PROMPT_33     #language x-AMI "IIOS22F"
#string STR_VMDPORTENABLE_PROMPT_34     #language x-AMI "IIOS230"
#string STR_VMDPORTENABLE_PROMPT_35     #language x-AMI "IIOS231"

#string STR_VMDPORTENABLE_PROMPT_36     #language x-AMI "IIOS232"
#string STR_VMDPORTENABLE_PROMPT_37     #language x-AMI "IIOS233"
#string STR_VMDPORTENABLE_PROMPT_38     #language x-AMI "IIOS234"
#string STR_VMDPORTENABLE_PROMPT_39     #language x-AMI "IIOS235"
#string STR_VMDPORTENABLE_PROMPT_40     #language x-AMI "IIOS236"
#string STR_VMDPORTENABLE_PROMPT_41     #language x-AMI "IIOS237"
#string STR_VMDPORTENABLE_PROMPT_42     #language x-AMI "IIOS238"
#string STR_VMDPORTENABLE_PROMPT_43     #language x-AMI "IIOS239"
#string STR_VMDPORTENABLE_PROMPT_44     #language x-AMI "IIOS23A"
#string STR_VMDPORTENABLE_PROMPT_45     #language x-AMI "IIOS23B"
#string STR_VMDPORTENABLE_PROMPT_46     #language x-AMI "IIOS23C"
#string STR_VMDPORTENABLE_PROMPT_47     #language x-AMI "IIOS23D"

#string STR_PCIE_IOU0_PROMPT_0          #language x-AMI "SMCBL001" //SMCPKG_SUPPORT
#string STR_PCIE_IOU0_PROMPT_1          #language x-AMI "SMCBL030" //SMCPKG_SUPPORT
#string STR_PCIE_IOU0_PROMPT_2          #language x-AMI "IIOS005"
#string STR_PCIE_IOU0_PROMPT_3          #language x-AMI "IIOS006"
#string STR_PCIE_IOU1_PROMPT_0          #language x-AMI "SMCBL002" //SMCPKG_SUPPORT
#string STR_PCIE_IOU1_PROMPT_1          #language x-AMI "SMCBL031" //SMCPKG_SUPPORT
#string STR_PCIE_IOU1_PROMPT_2          #language x-AMI "IIOS009"
#string STR_PCIE_IOU1_PROMPT_3          #language x-AMI "IIOS00A"
#string STR_PCIE_IOU2_PROMPT_0          #language x-AMI "SMCBL003" //SMCPKG_SUPPORT
#string STR_PCIE_IOU2_PROMPT_1          #language x-AMI "SMCBL032" //SMCPKG_SUPPORT
#string STR_PCIE_IOU2_PROMPT_2          #language x-AMI "IIOS00D"
#string STR_PCIE_IOU2_PROMPT_3          #language x-AMI "IIOS00E"

#string STR_PCIE_PORT_ENABLE_PROMPT_0   #language x-AMI "IIOS017"
#string STR_PCIE_PORT_ENABLE_PROMPT_1   #language x-AMI "IIOS018"
#string STR_PCIE_PORT_ENABLE_PROMPT_2   #language x-AMI "IIOS019"
#string STR_PCIE_PORT_ENABLE_PROMPT_3   #language x-AMI "IIOS01A"
#string STR_PCIE_PORT_ENABLE_PROMPT_4   #language x-AMI "IIOS01B"
#string STR_PCIE_PORT_ENABLE_PROMPT_5   #language x-AMI "IIOS01C"
#string STR_PCIE_PORT_ENABLE_PROMPT_6   #language x-AMI "IIOS01D"
#string STR_PCIE_PORT_ENABLE_PROMPT_7   #language x-AMI "IIOS01E"
#string STR_PCIE_PORT_ENABLE_PROMPT_8   #language x-AMI "IIOS01F"
#string STR_PCIE_PORT_ENABLE_PROMPT_9   #language x-AMI "IIOS020"
#string STR_PCIE_PORT_ENABLE_PROMPT_10  #language x-AMI "IIOS021"
#string STR_PCIE_PORT_ENABLE_PROMPT_11  #language x-AMI "IIOS022"
#string STR_PCIE_PORT_ENABLE_PROMPT_12  #language x-AMI "IIOS023"
#string STR_PCIE_PORT_ENABLE_PROMPT_13  #language x-AMI "IIOS024"
#string STR_PCIE_PORT_ENABLE_PROMPT_14  #language x-AMI "IIOS025"
#string STR_PCIE_PORT_ENABLE_PROMPT_15  #language x-AMI "IIOS026"
#string STR_PCIE_PORT_ENABLE_PROMPT_16  #language x-AMI "IIOS027"
#string STR_PCIE_PORT_ENABLE_PROMPT_17  #language x-AMI "IIOS028"
#string STR_PCIE_PORT_ENABLE_PROMPT_18  #language x-AMI "IIOS029"
#string STR_PCIE_PORT_ENABLE_PROMPT_19  #language x-AMI "IIOS02A"
#string STR_PCIE_PORT_ENABLE_PROMPT_20  #language x-AMI "IIOS02B"
#string STR_PCIE_PORT_ENABLE_PROMPT_21  #language x-AMI "IIOS02C"
#string STR_PCIE_PORT_ENABLE_PROMPT_22  #language x-AMI "IIOS02D"
#string STR_PCIE_PORT_ENABLE_PROMPT_23  #language x-AMI "IIOS02E"
#string STR_PCIE_PORT_ENABLE_PROMPT_24  #language x-AMI "IIOS02F"
#string STR_PCIE_PORT_ENABLE_PROMPT_25  #language x-AMI "IIOS030"
#string STR_PCIE_PORT_ENABLE_PROMPT_26  #language x-AMI "IIOS031"
#string STR_PCIE_PORT_ENABLE_PROMPT_27  #language x-AMI "IIOS032"
#string STR_PCIE_PORT_ENABLE_PROMPT_28  #language x-AMI "IIOS033"
#string STR_PCIE_PORT_ENABLE_PROMPT_29  #language x-AMI "IIOS034"
#string STR_PCIE_PORT_ENABLE_PROMPT_30  #language x-AMI "IIOS035"
#string STR_PCIE_PORT_ENABLE_PROMPT_31  #language x-AMI "IIOS036"
#string STR_PCIE_PORT_ENABLE_PROMPT_32  #language x-AMI "IIOS037"
#string STR_PCIE_PORT_ENABLE_PROMPT_33  #language x-AMI "IIOS038"
#string STR_PCIE_PORT_ENABLE_PROMPT_34  #language x-AMI "IIOS039"
#string STR_PCIE_PORT_ENABLE_PROMPT_35  #language x-AMI "IIOS03A"
#string STR_PCIE_PORT_ENABLE_PROMPT_36  #language x-AMI "IIOS03B"
#string STR_PCIE_PORT_ENABLE_PROMPT_37  #language x-AMI "IIOS03C"
#string STR_PCIE_PORT_ENABLE_PROMPT_38  #language x-AMI "IIOS03D"
#string STR_PCIE_PORT_ENABLE_PROMPT_39  #language x-AMI "IIOS03E"
#string STR_PCIE_PORT_ENABLE_PROMPT_40  #language x-AMI "IIOS03F"
#string STR_PCIE_PORT_ENABLE_PROMPT_41  #language x-AMI "IIOS040"
#string STR_PCIE_PORT_ENABLE_PROMPT_42  #language x-AMI "IIOS041"
#string STR_PCIE_PORT_ENABLE_PROMPT_43  #language x-AMI "IIOS042"
#string STR_PCIE_PORT_ENABLE_PROMPT_44  #language x-AMI "IIOS043"
#string STR_PCIE_PORT_ENABLE_PROMPT_45  #language x-AMI "IIOS044"
#string STR_PCIE_PORT_ENABLE_PROMPT_46  #language x-AMI "IIOS045"
#string STR_PCIE_PORT_ENABLE_PROMPT_47  #language x-AMI "IIOS046"
#string STR_PCIE_PORT_ENABLE_PROMPT_48  #language x-AMI "IIOS047"
#string STR_PCIE_PORT_ENABLE_PROMPT_49  #language x-AMI "IIOS048"
#string STR_PCIE_PORT_ENABLE_PROMPT_50  #language x-AMI "IIOS049"
#string STR_PCIE_PORT_ENABLE_PROMPT_51  #language x-AMI "IIOS04A"
#string STR_PCIE_PORT_ENABLE_PROMPT_52  #language x-AMI "IIOS04B"
#string STR_PCIE_PORT_ENABLE_PROMPT_53  #language x-AMI "IIOS04C"
#string STR_PCIE_PORT_ENABLE_PROMPT_54  #language x-AMI "IIOS04D"
#string STR_PCIE_PORT_ENABLE_PROMPT_55  #language x-AMI "IIOS04E"
#string STR_PCIE_PORT_ENABLE_PROMPT_56  #language x-AMI "IIOS04F"
#string STR_PCIE_PORT_ENABLE_PROMPT_57  #language x-AMI "IIOS050"
#string STR_PCIE_PORT_ENABLE_PROMPT_58  #language x-AMI "IIOS051"
#string STR_PCIE_PORT_ENABLE_PROMPT_59  #language x-AMI "IIOS052"
#string STR_PCIE_PORT_ENABLE_PROMPT_60  #language x-AMI "IIOS053"
#string STR_PCIE_PORT_ENABLE_PROMPT_61  #language x-AMI "IIOS054"
#string STR_PCIE_PORT_ENABLE_PROMPT_62  #language x-AMI "IIOS055"
#string STR_PCIE_PORT_ENABLE_PROMPT_63  #language x-AMI "IIOS056"
#string STR_PCIE_PORT_ENABLE_PROMPT_64  #language x-AMI "IIOS057"
#string STR_PCIE_PORT_ENABLE_PROMPT_65  #language x-AMI "IIOS058"
#string STR_PCIE_PORT_ENABLE_PROMPT_66  #language x-AMI "IIOS059"
#string STR_PCIE_PORT_ENABLE_PROMPT_67  #language x-AMI "IIOS05A"
#string STR_PCIE_PORT_ENABLE_PROMPT_68  #language x-AMI "IIOS05B"
#string STR_PCIE_PORT_ENABLE_PROMPT_69  #language x-AMI "IIOS05C"
#string STR_PCIE_PORT_ENABLE_PROMPT_70  #language x-AMI "IIOS05D"
#string STR_PCIE_PORT_ENABLE_PROMPT_71  #language x-AMI "IIOS05E"
#string STR_PCIE_PORT_ENABLE_PROMPT_72  #language x-AMI "IIOS05F"
#string STR_PCIE_PORT_ENABLE_PROMPT_73  #language x-AMI "IIOS060"
#string STR_PCIE_PORT_ENABLE_PROMPT_74  #language x-AMI "IIOS061"
#string STR_PCIE_PORT_ENABLE_PROMPT_75  #language x-AMI "IIOS062"
#string STR_PCIE_PORT_ENABLE_PROMPT_76  #language x-AMI "IIOS063"
#string STR_PCIE_PORT_ENABLE_PROMPT_77  #language x-AMI "IIOS064"
#string STR_PCIE_PORT_ENABLE_PROMPT_78  #language x-AMI "IIOS065"
#string STR_PCIE_PORT_ENABLE_PROMPT_79  #language x-AMI "IIOS066"
#string STR_PCIE_PORT_ENABLE_PROMPT_80  #language x-AMI "IIOS067"
#string STR_PCIE_PORT_ENABLE_PROMPT_81  #language x-AMI "IIOS068"
#string STR_PCIE_PORT_ENABLE_PROMPT_82  #language x-AMI "IIOS069"
#string STR_PCIE_PORT_ENABLE_PROMPT_83  #language x-AMI "IIOS06A"

#string STR_PCIE_PORT_LINK_PROMPT_0     #language x-AMI "IIOS0BF"
#string STR_PCIE_PORT_LINK_PROMPT_1     #language x-AMI "IIOS0C0"
#string STR_PCIE_PORT_LINK_PROMPT_2     #language x-AMI "IIOS0C1"
#string STR_PCIE_PORT_LINK_PROMPT_3     #language x-AMI "IIOS0C2"
#string STR_PCIE_PORT_LINK_PROMPT_4     #language x-AMI "IIOS0C3"
#string STR_PCIE_PORT_LINK_PROMPT_5     #language x-AMI "IIOS0C4"
#string STR_PCIE_PORT_LINK_PROMPT_6     #language x-AMI "IIOS0C5"
#string STR_PCIE_PORT_LINK_PROMPT_7     #language x-AMI "IIOS0C6"
#string STR_PCIE_PORT_LINK_PROMPT_8     #language x-AMI "IIOS0C7"
#string STR_PCIE_PORT_LINK_PROMPT_9     #language x-AMI "IIOS0C8"
#string STR_PCIE_PORT_LINK_PROMPT_10    #language x-AMI "IIOS0C9"
#string STR_PCIE_PORT_LINK_PROMPT_11    #language x-AMI "IIOS0CA"
#string STR_PCIE_PORT_LINK_PROMPT_12    #language x-AMI "IIOS0CB"
#string STR_PCIE_PORT_LINK_PROMPT_13    #language x-AMI "IIOS0CC"
#string STR_PCIE_PORT_LINK_PROMPT_14    #language x-AMI "IIOS0CD"
#string STR_PCIE_PORT_LINK_PROMPT_15    #language x-AMI "IIOS0CE"
#string STR_PCIE_PORT_LINK_PROMPT_16    #language x-AMI "IIOS0CF"
#string STR_PCIE_PORT_LINK_PROMPT_17    #language x-AMI "IIOS0D0"
#string STR_PCIE_PORT_LINK_PROMPT_18    #language x-AMI "IIOS0D1"
#string STR_PCIE_PORT_LINK_PROMPT_19    #language x-AMI "IIOS0D2"
#string STR_PCIE_PORT_LINK_PROMPT_20    #language x-AMI "IIOS0D3"
#string STR_PCIE_PORT_LINK_PROMPT_21    #language x-AMI "IIOS0D4"
#string STR_PCIE_PORT_LINK_PROMPT_22    #language x-AMI "IIOS0D5"
#string STR_PCIE_PORT_LINK_PROMPT_23    #language x-AMI "IIOS0D6"
#string STR_PCIE_PORT_LINK_PROMPT_24    #language x-AMI "IIOS0D7"
#string STR_PCIE_PORT_LINK_PROMPT_25    #language x-AMI "IIOS0D8"
#string STR_PCIE_PORT_LINK_PROMPT_26    #language x-AMI "IIOS0D9"
#string STR_PCIE_PORT_LINK_PROMPT_27    #language x-AMI "IIOS0DA"
#string STR_PCIE_PORT_LINK_PROMPT_28    #language x-AMI "IIOS0DB"
#string STR_PCIE_PORT_LINK_PROMPT_29    #language x-AMI "IIOS0DC"
#string STR_PCIE_PORT_LINK_PROMPT_30    #language x-AMI "IIOS0DD"
#string STR_PCIE_PORT_LINK_PROMPT_31    #language x-AMI "IIOS0DE"
#string STR_PCIE_PORT_LINK_PROMPT_32    #language x-AMI "IIOS0DF"
#string STR_PCIE_PORT_LINK_PROMPT_33    #language x-AMI "IIOS0E0"
#string STR_PCIE_PORT_LINK_PROMPT_34    #language x-AMI "IIOS0E1"
#string STR_PCIE_PORT_LINK_PROMPT_35    #language x-AMI "IIOS0E2"
#string STR_PCIE_PORT_LINK_PROMPT_36    #language x-AMI "IIOS0E3"
#string STR_PCIE_PORT_LINK_PROMPT_37    #language x-AMI "IIOS0E4"
#string STR_PCIE_PORT_LINK_PROMPT_38    #language x-AMI "IIOS0E5"
#string STR_PCIE_PORT_LINK_PROMPT_39    #language x-AMI "IIOS0E6"
#string STR_PCIE_PORT_LINK_PROMPT_40    #language x-AMI "IIOS0E7"
#string STR_PCIE_PORT_LINK_PROMPT_41    #language x-AMI "IIOS0E8"
#string STR_PCIE_PORT_LINK_PROMPT_42    #language x-AMI "IIOS0E9"
#string STR_PCIE_PORT_LINK_PROMPT_43    #language x-AMI "IIOS0EA"
#string STR_PCIE_PORT_LINK_PROMPT_44    #language x-AMI "IIOS0EB"
#string STR_PCIE_PORT_LINK_PROMPT_45    #language x-AMI "IIOS0EC"
#string STR_PCIE_PORT_LINK_PROMPT_46    #language x-AMI "IIOS0ED"
#string STR_PCIE_PORT_LINK_PROMPT_47    #language x-AMI "IIOS0EE"
#string STR_PCIE_PORT_LINK_PROMPT_48    #language x-AMI "IIOS0EF"
#string STR_PCIE_PORT_LINK_PROMPT_49    #language x-AMI "IIOS0F0"
#string STR_PCIE_PORT_LINK_PROMPT_50    #language x-AMI "IIOS0F1"
#string STR_PCIE_PORT_LINK_PROMPT_51    #language x-AMI "IIOS0F2"
#string STR_PCIE_PORT_LINK_PROMPT_52    #language x-AMI "IIOS0F3"
#string STR_PCIE_PORT_LINK_PROMPT_53    #language x-AMI "IIOS0F4"
#string STR_PCIE_PORT_LINK_PROMPT_54    #language x-AMI "IIOS0F5"
#string STR_PCIE_PORT_LINK_PROMPT_55    #language x-AMI "IIOS0F6"
#string STR_PCIE_PORT_LINK_PROMPT_56    #language x-AMI "IIOS0F7"
#string STR_PCIE_PORT_LINK_PROMPT_57    #language x-AMI "IIOS0F8"
#string STR_PCIE_PORT_LINK_PROMPT_58    #language x-AMI "IIOS0F9"
#string STR_PCIE_PORT_LINK_PROMPT_59    #language x-AMI "IIOS0FA"
#string STR_PCIE_PORT_LINK_PROMPT_60    #language x-AMI "IIOS0FB"
#string STR_PCIE_PORT_LINK_PROMPT_61    #language x-AMI "IIOS0FC"
#string STR_PCIE_PORT_LINK_PROMPT_62    #language x-AMI "IIOS0FD"
#string STR_PCIE_PORT_LINK_PROMPT_63    #language x-AMI "IIOS0FE"
#string STR_PCIE_PORT_LINK_PROMPT_64    #language x-AMI "IIOS0FF"
#string STR_PCIE_PORT_LINK_PROMPT_65    #language x-AMI "IIOS100"
#string STR_PCIE_PORT_LINK_PROMPT_66    #language x-AMI "IIOS101"
#string STR_PCIE_PORT_LINK_PROMPT_67    #language x-AMI "IIOS102"
#string STR_PCIE_PORT_LINK_PROMPT_68    #language x-AMI "IIOS103"
#string STR_PCIE_PORT_LINK_PROMPT_69    #language x-AMI "IIOS104"
#string STR_PCIE_PORT_LINK_PROMPT_70    #language x-AMI "IIOS105"
#string STR_PCIE_PORT_LINK_PROMPT_71    #language x-AMI "IIOS106"
#string STR_PCIE_PORT_LINK_PROMPT_72    #language x-AMI "IIOS107"
#string STR_PCIE_PORT_LINK_PROMPT_73    #language x-AMI "IIOS108"
#string STR_PCIE_PORT_LINK_PROMPT_74    #language x-AMI "IIOS109"
#string STR_PCIE_PORT_LINK_PROMPT_75    #language x-AMI "IIOS10A"
#string STR_PCIE_PORT_LINK_PROMPT_76    #language x-AMI "IIOS10B"
#string STR_PCIE_PORT_LINK_PROMPT_77    #language x-AMI "IIOS10C"
#string STR_PCIE_PORT_LINK_PROMPT_78    #language x-AMI "IIOS10D"
#string STR_PCIE_PORT_LINK_PROMPT_79    #language x-AMI "IIOS10E"
#string STR_PCIE_PORT_LINK_PROMPT_80    #language x-AMI "IIOS10F"
#string STR_PCIE_PORT_LINK_PROMPT_81    #language x-AMI "IIOS110"
#string STR_PCIE_PORT_LINK_PROMPT_82    #language x-AMI "IIOS111"
#string STR_PCIE_PORT_LINK_PROMPT_83    #language x-AMI "IIOS112"

#string STR_PCIE_PORT_HPCAP_PROMPT_0    #language x-AMI "IIOS24A"
#string STR_PCIE_PORT_HPCAP_PROMPT_1    #language x-AMI "IIOS24B"
#string STR_PCIE_PORT_HPCAP_PROMPT_2    #language x-AMI "IIOS24C"
#string STR_PCIE_PORT_HPCAP_PROMPT_3    #language x-AMI "IIOS24D"
#string STR_PCIE_PORT_HPCAP_PROMPT_4    #language x-AMI "IIOS24E"
#string STR_PCIE_PORT_HPCAP_PROMPT_5    #language x-AMI "IIOS24F"
#string STR_PCIE_PORT_HPCAP_PROMPT_6    #language x-AMI "IIOS250"
#string STR_PCIE_PORT_HPCAP_PROMPT_7    #language x-AMI "IIOS251"
#string STR_PCIE_PORT_HPCAP_PROMPT_8    #language x-AMI "IIOS252"
#string STR_PCIE_PORT_HPCAP_PROMPT_9    #language x-AMI "IIOS253"
#string STR_PCIE_PORT_HPCAP_PROMPT_10   #language x-AMI "IIOS254"
#string STR_PCIE_PORT_HPCAP_PROMPT_11   #language x-AMI "IIOS255"
#string STR_PCIE_PORT_HPCAP_PROMPT_12   #language x-AMI "IIOS256"
#string STR_PCIE_PORT_HPCAP_PROMPT_13   #language x-AMI "IIOS257"
#string STR_PCIE_PORT_HPCAP_PROMPT_14   #language x-AMI "IIOS258"
#string STR_PCIE_PORT_HPCAP_PROMPT_15   #language x-AMI "IIOS259"
#string STR_PCIE_PORT_HPCAP_PROMPT_16   #language x-AMI "IIOS25A"
#string STR_PCIE_PORT_HPCAP_PROMPT_17   #language x-AMI "IIOS25B"
#string STR_PCIE_PORT_HPCAP_PROMPT_18   #language x-AMI "IIOS25C"
#string STR_PCIE_PORT_HPCAP_PROMPT_19   #language x-AMI "IIOS25D"
#string STR_PCIE_PORT_HPCAP_PROMPT_20   #language x-AMI "IIOS25E"
#string STR_PCIE_PORT_HPCAP_PROMPT_21   #language x-AMI "IIOS25F"
#string STR_PCIE_PORT_HPCAP_PROMPT_22   #language x-AMI "IIOS260"
#string STR_PCIE_PORT_HPCAP_PROMPT_23   #language x-AMI "IIOS261"
#string STR_PCIE_PORT_HPCAP_PROMPT_24   #language x-AMI "IIOS262"
#string STR_PCIE_PORT_HPCAP_PROMPT_25   #language x-AMI "IIOS263"
#string STR_PCIE_PORT_HPCAP_PROMPT_26   #language x-AMI "IIOS264"
#string STR_PCIE_PORT_HPCAP_PROMPT_27   #language x-AMI "IIOS265"
#string STR_PCIE_PORT_HPCAP_PROMPT_28   #language x-AMI "IIOS266"
#string STR_PCIE_PORT_HPCAP_PROMPT_29   #language x-AMI "IIOS267"
#string STR_PCIE_PORT_HPCAP_PROMPT_30   #language x-AMI "IIOS268"
#string STR_PCIE_PORT_HPCAP_PROMPT_31   #language x-AMI "IIOS269"
#string STR_PCIE_PORT_HPCAP_PROMPT_32   #language x-AMI "IIOS26A"
#string STR_PCIE_PORT_HPCAP_PROMPT_33   #language x-AMI "IIOS26B"
#string STR_PCIE_PORT_HPCAP_PROMPT_34   #language x-AMI "IIOS26C"
#string STR_PCIE_PORT_HPCAP_PROMPT_35   #language x-AMI "IIOS26D"
#string STR_PCIE_PORT_HPCAP_PROMPT_36   #language x-AMI "IIOS26E"
#string STR_PCIE_PORT_HPCAP_PROMPT_37   #language x-AMI "IIOS26F"
#string STR_PCIE_PORT_HPCAP_PROMPT_38   #language x-AMI "IIOS270"
#string STR_PCIE_PORT_HPCAP_PROMPT_39   #language x-AMI "IIOS271"
#string STR_PCIE_PORT_HPCAP_PROMPT_40   #language x-AMI "IIOS272"
#string STR_PCIE_PORT_HPCAP_PROMPT_41   #language x-AMI "IIOS273"
#string STR_PCIE_PORT_HPCAP_PROMPT_42   #language x-AMI "IIOS274"
#string STR_PCIE_PORT_HPCAP_PROMPT_43   #language x-AMI "IIOS275"
#string STR_PCIE_PORT_HPCAP_PROMPT_44   #language x-AMI "IIOS276"
#string STR_PCIE_PORT_HPCAP_PROMPT_45   #language x-AMI "IIOS277"
#string STR_PCIE_PORT_HPCAP_PROMPT_46   #language x-AMI "IIOS278"
#string STR_PCIE_PORT_HPCAP_PROMPT_47   #language x-AMI "IIOS279"
#string STR_PCIE_PORT_HPCAP_PROMPT_48   #language x-AMI "IIOS27A"
#string STR_PCIE_PORT_HPCAP_PROMPT_49   #language x-AMI "IIOS27B"
#string STR_PCIE_PORT_HPCAP_PROMPT_50   #language x-AMI "IIOS27C"
#string STR_PCIE_PORT_HPCAP_PROMPT_51   #language x-AMI "IIOS27D"
#string STR_PCIE_PORT_HPCAP_PROMPT_52   #language x-AMI "IIOS27E"
#string STR_PCIE_PORT_HPCAP_PROMPT_53   #language x-AMI "IIOS27F"
#string STR_PCIE_PORT_HPCAP_PROMPT_54   #language x-AMI "IIOS280"
#string STR_PCIE_PORT_HPCAP_PROMPT_55   #language x-AMI "IIOS281"
#string STR_PCIE_PORT_HPCAP_PROMPT_56   #language x-AMI "IIOS282"
#string STR_PCIE_PORT_HPCAP_PROMPT_57   #language x-AMI "IIOS283"
#string STR_PCIE_PORT_HPCAP_PROMPT_58   #language x-AMI "IIOS284"
#string STR_PCIE_PORT_HPCAP_PROMPT_59   #language x-AMI "IIOS285"
#string STR_PCIE_PORT_HPCAP_PROMPT_60   #language x-AMI "IIOS286"
#string STR_PCIE_PORT_HPCAP_PROMPT_61   #language x-AMI "IIOS287"
#string STR_PCIE_PORT_HPCAP_PROMPT_62   #language x-AMI "IIOS288"
#string STR_PCIE_PORT_HPCAP_PROMPT_63   #language x-AMI "IIOS289"
#string STR_PCIE_PORT_HPCAP_PROMPT_64   #language x-AMI "IIOS28A"
#string STR_PCIE_PORT_HPCAP_PROMPT_65   #language x-AMI "IIOS28B"
#string STR_PCIE_PORT_HPCAP_PROMPT_66   #language x-AMI "IIOS28C"
#string STR_PCIE_PORT_HPCAP_PROMPT_67   #language x-AMI "IIOS28D"
#string STR_PCIE_PORT_HPCAP_PROMPT_68   #language x-AMI "IIOS28E"
#string STR_PCIE_PORT_HPCAP_PROMPT_69   #language x-AMI "IIOS28F"
#string STR_PCIE_PORT_HPCAP_PROMPT_70   #language x-AMI "IIOS290"
#string STR_PCIE_PORT_HPCAP_PROMPT_71   #language x-AMI "IIOS291"
#string STR_PCIE_PORT_HPCAP_PROMPT_72   #language x-AMI "IIOS292"
#string STR_PCIE_PORT_HPCAP_PROMPT_73   #language x-AMI "IIOS293"
#string STR_PCIE_PORT_HPCAP_PROMPT_74   #language x-AMI "IIOS294"
#string STR_PCIE_PORT_HPCAP_PROMPT_75   #language x-AMI "IIOS295"
#string STR_PCIE_PORT_HPCAP_PROMPT_76   #language x-AMI "IIOS296"
#string STR_PCIE_PORT_HPCAP_PROMPT_77   #language x-AMI "IIOS297"
#string STR_PCIE_PORT_HPCAP_PROMPT_78   #language x-AMI "IIOS298"
#string STR_PCIE_PORT_HPCAP_PROMPT_79   #language x-AMI "IIOS299"
#string STR_PCIE_PORT_HPCAP_PROMPT_80   #language x-AMI "IIOS29A"
#string STR_PCIE_PORT_HPCAP_PROMPT_81   #language x-AMI "IIOS29B"
#string STR_PCIE_PORT_HPCAP_PROMPT_82   #language x-AMI "IIOS29C"
#string STR_PCIE_PORT_HPCAP_PROMPT_83   #language x-AMI "IIOS29D"

#string STR_PCIE_PORT_HPSUPCAP_PROMPT_0    #language x-AMI "IIOS06B"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_1    #language x-AMI "IIOS06C"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_2    #language x-AMI "IIOS06D"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_3    #language x-AMI "IIOS06E"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_4    #language x-AMI "IIOS06F"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_5    #language x-AMI "IIOS070"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_6    #language x-AMI "IIOS071"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_7    #language x-AMI "IIOS072"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_8    #language x-AMI "IIOS073"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_9    #language x-AMI "IIOS074"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_10   #language x-AMI "IIOS075"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_11   #language x-AMI "IIOS076"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_12   #language x-AMI "IIOS077"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_13   #language x-AMI "IIOS078"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_14   #language x-AMI "IIOS079"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_15   #language x-AMI "IIOS07A"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_16   #language x-AMI "IIOS07B"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_17   #language x-AMI "IIOS07C"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_18   #language x-AMI "IIOS07D"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_19   #language x-AMI "IIOS07E"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_20   #language x-AMI "IIOS07F"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_21   #language x-AMI "IIOS080"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_22   #language x-AMI "IIOS081"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_23   #language x-AMI "IIOS082"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_24   #language x-AMI "IIOS083"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_25   #language x-AMI "IIOS084"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_26   #language x-AMI "IIOS085"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_27   #language x-AMI "IIOS086"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_28   #language x-AMI "IIOS087"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_29   #language x-AMI "IIOS088"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_30   #language x-AMI "IIOS089"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_31   #language x-AMI "IIOS08A"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_32   #language x-AMI "IIOS08B"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_33   #language x-AMI "IIOS08C"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_34   #language x-AMI "IIOS08D"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_35   #language x-AMI "IIOS08E"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_36   #language x-AMI "IIOS08F"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_37   #language x-AMI "IIOS090"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_38   #language x-AMI "IIOS091"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_39   #language x-AMI "IIOS092"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_40   #language x-AMI "IIOS093"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_41   #language x-AMI "IIOS094"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_42   #language x-AMI "IIOS095"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_43   #language x-AMI "IIOS096"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_44   #language x-AMI "IIOS097"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_45   #language x-AMI "IIOS098"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_46   #language x-AMI "IIOS099"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_47   #language x-AMI "IIOS09A"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_48   #language x-AMI "IIOS09B"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_49   #language x-AMI "IIOS09C"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_50   #language x-AMI "IIOS09D"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_51   #language x-AMI "IIOS09E"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_52   #language x-AMI "IIOS09F"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_53   #language x-AMI "IIOS0A0"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_54   #language x-AMI "IIOS0A1"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_55   #language x-AMI "IIOS0A2"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_56   #language x-AMI "IIOS0A3"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_57   #language x-AMI "IIOS0A4"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_58   #language x-AMI "IIOS0A5"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_59   #language x-AMI "IIOS0A6"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_60   #language x-AMI "IIOS0A7"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_61   #language x-AMI "IIOS0A8"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_62   #language x-AMI "IIOS0A9"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_63   #language x-AMI "IIOS0AA"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_64   #language x-AMI "IIOS0AB"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_65   #language x-AMI "IIOS0AC"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_66   #language x-AMI "IIOS0AD"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_67   #language x-AMI "IIOS0AE"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_68   #language x-AMI "IIOS0AF"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_69   #language x-AMI "IIOS0B0"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_70   #language x-AMI "IIOS0B1"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_71   #language x-AMI "IIOS0B2"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_72   #language x-AMI "IIOS0B3"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_73   #language x-AMI "IIOS0B4"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_74   #language x-AMI "IIOS0B5"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_75   #language x-AMI "IIOS0B6"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_76   #language x-AMI "IIOS0B7"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_77   #language x-AMI "IIOS0B8"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_78   #language x-AMI "IIOS0B9"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_79   #language x-AMI "IIOS0BA"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_80   #language x-AMI "IIOS0BB"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_81   #language x-AMI "IIOS0BC"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_82   #language x-AMI "IIOS0BD"
#string STR_PCIE_PORT_HPSUPCAP_PROMPT_83   #language x-AMI "IIOS0BE"

#string STR_IIO_ECRC_PROMPT_0            #language x-AMI "IIOS167"
#string STR_IIO_ECRC_PROMPT_1            #language x-AMI "IIOS168"
#string STR_IIO_ECRC_PROMPT_2            #language x-AMI "IIOS169"
#string STR_IIO_ECRC_PROMPT_3            #language x-AMI "IIOS16A"
#string STR_IIO_ECRC_PROMPT_4            #language x-AMI "IIOS16B"
#string STR_IIO_ECRC_PROMPT_5            #language x-AMI "IIOS16C"
#string STR_IIO_ECRC_PROMPT_6            #language x-AMI "IIOS16D"
#string STR_IIO_ECRC_PROMPT_7            #language x-AMI "IIOS16E"
#string STR_IIO_ECRC_PROMPT_8            #language x-AMI "IIOS16F"
#string STR_IIO_ECRC_PROMPT_9            #language x-AMI "IIOS170"
#string STR_IIO_ECRC_PROMPT_10            #language x-AMI "IIOS171"
#string STR_IIO_ECRC_PROMPT_11            #language x-AMI "IIOS172"
#string STR_IIO_ECRC_PROMPT_12            #language x-AMI "IIOS173"
#string STR_IIO_ECRC_PROMPT_13            #language x-AMI "IIOS174"
#string STR_IIO_ECRC_PROMPT_14            #language x-AMI "IIOS175"
#string STR_IIO_ECRC_PROMPT_15            #language x-AMI "IIOS176"
#string STR_IIO_ECRC_PROMPT_16            #language x-AMI "IIOS177"
#string STR_IIO_ECRC_PROMPT_17            #language x-AMI "IIOS178"
#string STR_IIO_ECRC_PROMPT_18            #language x-AMI "IIOS179"
#string STR_IIO_ECRC_PROMPT_19            #language x-AMI "IIOS17A"
#string STR_IIO_ECRC_PROMPT_20            #language x-AMI "IIOS17B"
#string STR_IIO_ECRC_PROMPT_21            #language x-AMI "IIOS17C"
#string STR_IIO_ECRC_PROMPT_22            #language x-AMI "IIOS17D"
#string STR_IIO_ECRC_PROMPT_23            #language x-AMI "IIOS17E"
#string STR_IIO_ECRC_PROMPT_24            #language x-AMI "IIOS17F"
#string STR_IIO_ECRC_PROMPT_25            #language x-AMI "IIOS180"
#string STR_IIO_ECRC_PROMPT_26            #language x-AMI "IIOS181"
#string STR_IIO_ECRC_PROMPT_27            #language x-AMI "IIOS182"
#string STR_IIO_ECRC_PROMPT_28            #language x-AMI "IIOS183"
#string STR_IIO_ECRC_PROMPT_29            #language x-AMI "IIOS184"
#string STR_IIO_ECRC_PROMPT_30            #language x-AMI "IIOS185"
#string STR_IIO_ECRC_PROMPT_31            #language x-AMI "IIOS186"
#string STR_IIO_ECRC_PROMPT_32            #language x-AMI "IIOS187"
#string STR_IIO_ECRC_PROMPT_33            #language x-AMI "IIOS188"
#string STR_IIO_ECRC_PROMPT_34            #language x-AMI "IIOS189"
#string STR_IIO_ECRC_PROMPT_35            #language x-AMI "IIOS18A"
#string STR_IIO_ECRC_PROMPT_36            #language x-AMI "IIOS18B"
#string STR_IIO_ECRC_PROMPT_37            #language x-AMI "IIOS18C"
#string STR_IIO_ECRC_PROMPT_38            #language x-AMI "IIOS18D"
#string STR_IIO_ECRC_PROMPT_39            #language x-AMI "IIOS18E"
#string STR_IIO_ECRC_PROMPT_40            #language x-AMI "IIOS18F"
#string STR_IIO_ECRC_PROMPT_41            #language x-AMI "IIOS190"
#string STR_IIO_ECRC_PROMPT_42            #language x-AMI "IIOS191"
#string STR_IIO_ECRC_PROMPT_43            #language x-AMI "IIOS192"
#string STR_IIO_ECRC_PROMPT_44            #language x-AMI "IIOS193"
#string STR_IIO_ECRC_PROMPT_45            #language x-AMI "IIOS194"
#string STR_IIO_ECRC_PROMPT_46            #language x-AMI "IIOS195"
#string STR_IIO_ECRC_PROMPT_47            #language x-AMI "IIOS196"
#string STR_IIO_ECRC_PROMPT_48            #language x-AMI "IIOS197"
#string STR_IIO_ECRC_PROMPT_49            #language x-AMI "IIOS198"
#string STR_IIO_ECRC_PROMPT_50            #language x-AMI "IIOS199"
#string STR_IIO_ECRC_PROMPT_51            #language x-AMI "IIOS19A"
#string STR_IIO_ECRC_PROMPT_52            #language x-AMI "IIOS19B"
#string STR_IIO_ECRC_PROMPT_53            #language x-AMI "IIOS19C"
#string STR_IIO_ECRC_PROMPT_54            #language x-AMI "IIOS19D"
#string STR_IIO_ECRC_PROMPT_55            #language x-AMI "IIOS19E"
#string STR_IIO_ECRC_PROMPT_56            #language x-AMI "IIOS19F"
#string STR_IIO_ECRC_PROMPT_57            #language x-AMI "IIOS1A0"
#string STR_IIO_ECRC_PROMPT_58            #language x-AMI "IIOS1A1"
#string STR_IIO_ECRC_PROMPT_59            #language x-AMI "IIOS1A2"
#string STR_IIO_ECRC_PROMPT_60            #language x-AMI "IIOS1A3"
#string STR_IIO_ECRC_PROMPT_61            #language x-AMI "IIOS1A4"
#string STR_IIO_ECRC_PROMPT_62            #language x-AMI "IIOS1A5"
#string STR_IIO_ECRC_PROMPT_63            #language x-AMI "IIOS1A6"
#string STR_IIO_ECRC_PROMPT_64            #language x-AMI "IIOS1A7"
#string STR_IIO_ECRC_PROMPT_65            #language x-AMI "IIOS1A8"
#string STR_IIO_ECRC_PROMPT_66            #language x-AMI "IIOS1A9"
#string STR_IIO_ECRC_PROMPT_67            #language x-AMI "IIOS1AA"
#string STR_IIO_ECRC_PROMPT_68            #language x-AMI "IIOS1AB"
#string STR_IIO_ECRC_PROMPT_69            #language x-AMI "IIOS1AC"
#string STR_IIO_ECRC_PROMPT_70            #language x-AMI "IIOS1AD"
#string STR_IIO_ECRC_PROMPT_71            #language x-AMI "IIOS1AE"
#string STR_IIO_ECRC_PROMPT_72            #language x-AMI "IIOS1AF"
#string STR_IIO_ECRC_PROMPT_73            #language x-AMI "IIOS1B0"
#string STR_IIO_ECRC_PROMPT_74            #language x-AMI "IIOS1B1"
#string STR_IIO_ECRC_PROMPT_75            #language x-AMI "IIOS1B2"
#string STR_IIO_ECRC_PROMPT_76            #language x-AMI "IIOS1B3"
#string STR_IIO_ECRC_PROMPT_77            #language x-AMI "IIOS1B4"
#string STR_IIO_ECRC_PROMPT_78            #language x-AMI "IIOS1B5"
#string STR_IIO_ECRC_PROMPT_79            #language x-AMI "IIOS1B6"
#string STR_IIO_ECRC_PROMPT_80            #language x-AMI "IIOS1B7"
#string STR_IIO_ECRC_PROMPT_81            #language x-AMI "IIOS1B8"
#string STR_IIO_ECRC_PROMPT_82            #language x-AMI "IIOS1B9"
#string STR_IIO_ECRC_PROMPT_83            #language x-AMI "IIOS1BA"

#string STR_CB3_00_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1BE"
#string STR_CB3_01_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1BF"
#string STR_CB3_02_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C0"
#string STR_CB3_03_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C1"
#string STR_CB3_04_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C2"
#string STR_CB3_05_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C3"
#string STR_CB3_06_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C4"
#string STR_CB3_07_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C5"
#string STR_CB3_10_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C6"
#string STR_CB3_11_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C7"
#string STR_CB3_12_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C8"
#string STR_CB3_13_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1C9"
#string STR_CB3_14_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1CA"
#string STR_CB3_15_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1CB"
#string STR_CB3_16_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1CC"
#string STR_CB3_17_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1CD"
#string STR_CB3_20_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1CE"
#string STR_CB3_21_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1CF"
#string STR_CB3_22_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D0"
#string STR_CB3_23_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D1"
#string STR_CB3_24_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D2"
#string STR_CB3_25_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D3"
#string STR_CB3_26_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D4"
#string STR_CB3_27_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D5"
#string STR_CB3_30_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D6"
#string STR_CB3_31_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D7"
#string STR_CB3_32_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D8"
#string STR_CB3_33_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1D9"
#string STR_CB3_34_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1DA"
#string STR_CB3_35_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1DB"
#string STR_CB3_36_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1DC"
#string STR_CB3_37_DMA_ENABLE_PROMPT             #language x-AMI "IIOS1DD"

#string STR_CB3_00_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1DE"
#string STR_CB3_01_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1DF"
#string STR_CB3_02_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E0"
#string STR_CB3_03_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E1"
#string STR_CB3_04_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E2"
#string STR_CB3_05_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E3"
#string STR_CB3_06_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E4"
#string STR_CB3_07_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E5"
#string STR_CB3_10_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E6"
#string STR_CB3_11_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E7"
#string STR_CB3_12_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E8"
#string STR_CB3_13_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1E9"
#string STR_CB3_14_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1EA"
#string STR_CB3_15_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1EB"
#string STR_CB3_16_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1EC"
#string STR_CB3_17_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1ED"
#string STR_CB3_20_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1EE"
#string STR_CB3_21_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1EF"
#string STR_CB3_22_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F0"
#string STR_CB3_23_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F1"
#string STR_CB3_24_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F2"
#string STR_CB3_25_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F3"
#string STR_CB3_26_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F4"
#string STR_CB3_27_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F5"
#string STR_CB3_30_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F6"
#string STR_CB3_31_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F7"
#string STR_CB3_32_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F8"
#string STR_CB3_33_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1F9"
#string STR_CB3_34_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1FA"
#string STR_CB3_35_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1FB"
#string STR_CB3_36_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1FC"
#string STR_CB3_37_NO_SNOOP_ENABLE_PROMPT  #language x-AMI "IIOS1FD"

#string STR_CB3_0_DCA_ENABLE_PROMPT        #language x-AMI "IIOS1BC"

#string STR_CB3_1_DCA_ENABLE_PROMPT        #language x-AMI "IIOS1BD"

#string STR_PCIE_PORT_LINK_SPEED_PROMPT_0       #language x-AMI "SMCBL006" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_1       #language x-AMI "SMCBL008" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_2       #language x-AMI "SMCBL00A" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_3       #language x-AMI "SMCBL00C" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_4       #language x-AMI "SMCBL00E" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_5       #language x-AMI "SMCBL010" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_6       #language x-AMI "SMCBL012" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_7       #language x-AMI "SMCBL014" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_8       #language x-AMI "SMCBL016" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_9       #language x-AMI "SMCBL018" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_10      #language x-AMI "SMCBL01A" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_11      #language x-AMI "SMCBL01C" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_12      #language x-AMI "SMCBL01E" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_13      #language x-AMI "SMCBL020" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_14      #language x-AMI "SMCBL022" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_15      #language x-AMI "SMCBL024" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_16      #language x-AMI "SMCBL026" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_17      #language x-AMI "SMCBL028" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_18      #language x-AMI "SMCBL02A" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_19      #language x-AMI "SMCBL02C" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_20      #language x-AMI "SMCBL02E" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_21      #language x-AMI "SMCBL035" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_22      #language x-AMI "SMCBL037" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_23      #language x-AMI "SMCBL039" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_24      #language x-AMI "SMCBL03B" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_25      #language x-AMI "SMCBL03D" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_26      #language x-AMI "SMCBL03F" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_27      #language x-AMI "SMCBL041" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_28      #language x-AMI "SMCBL043" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_29      #language x-AMI "SMCBL045" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_30      #language x-AMI "SMCBL047" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_31      #language x-AMI "SMCBL049" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_32      #language x-AMI "SMCBL04B" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_33      #language x-AMI "SMCBL04D" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_34      #language x-AMI "SMCBL04F" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_35      #language x-AMI "SMCBL051" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_36      #language x-AMI "SMCBL053" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_37      #language x-AMI "SMCBL055" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_38      #language x-AMI "SMCBL057" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_39      #language x-AMI "SMCBL059" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_40      #language x-AMI "SMCBL05B" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_41      #language x-AMI "SMCBL05D" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_42      #language x-AMI "IIOS13D"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_43      #language x-AMI "IIOS13E"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_44      #language x-AMI "IIOS13F"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_45      #language x-AMI "IIOS140"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_46      #language x-AMI "IIOS141"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_47      #language x-AMI "IIOS142"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_48      #language x-AMI "IIOS143"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_49      #language x-AMI "IIOS144"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_50      #language x-AMI "IIOS145"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_51      #language x-AMI "IIOS146"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_52      #language x-AMI "IIOS147"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_53      #language x-AMI "IIOS148"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_54      #language x-AMI "IIOS149"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_55      #language x-AMI "IIOS14A"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_56      #language x-AMI "IIOS14B"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_57      #language x-AMI "IIOS14C"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_58      #language x-AMI "IIOS14D"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_59      #language x-AMI "IIOS14E"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_60      #language x-AMI "IIOS14F"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_61      #language x-AMI "IIOS150"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_62      #language x-AMI "IIOS151"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_63      #language x-AMI "IIOS152"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_64      #language x-AMI "IIOS153"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_65      #language x-AMI "IIOS154"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_66      #language x-AMI "IIOS155"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_67      #language x-AMI "IIOS156"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_68      #language x-AMI "IIOS157"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_69      #language x-AMI "IIOS158"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_70      #language x-AMI "IIOS159"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_71      #language x-AMI "IIOS15A"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_72      #language x-AMI "IIOS15B"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_73      #language x-AMI "IIOS15C"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_74      #language x-AMI "IIOS15D"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_75      #language x-AMI "IIOS15E"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_76      #language x-AMI "IIOS15F"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_77      #language x-AMI "IIOS160"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_78      #language x-AMI "IIOS161"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_79      #language x-AMI "IIOS162"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_80      #language x-AMI "IIOS163"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_81      #language x-AMI "IIOS164"
#string STR_PCIE_PORT_LINK_SPEED_PROMPT_82      #language x-AMI "IIOS165"

#string STR_PCIE_PORT_LINK_SPEED_PROMPT_83      #language x-AMI "IIOS166"

//#string STR_IODC_PROMPT                       #language x-AMI "IIOS1BB"
#string STR_IODC_PROMPT_PORT_0            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS367"
#string STR_IODC_PROMPT_PORT_1            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS368"
#string STR_IODC_PROMPT_PORT_2            	#language en-US "IODC Configuration"	
						#language x-AMI "IIOS369"
#string STR_IODC_PROMPT_PORT_3             	#language en-US "IODC Configuration"
						#language x-AMI "IIOS36A"
#string STR_IODC_PROMPT_PORT_4            	#language en-US "IODC Configuration"	
						#language x-AMI "IIOS36B"
#string STR_IODC_PROMPT_PORT_5             	#language en-US "IODC Configuration"
						#language x-AMI "IIOS36C"
#string STR_IODC_PROMPT_PORT_6            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS36D"
#string STR_IODC_PROMPT_PORT_7            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS36E"
#string STR_IODC_PROMPT_PORT_8            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS36F
#string STR_IODC_PROMPT_PORT_9            	#language en-US "IODC Configuration"	
						#language x-AMI "IIOS370"
#string STR_IODC_PROMPT_PORT_10            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS371"
#string STR_IODC_PROMPT_PORT_11            	#language en-US "IODC Configuration"	
						#language x-AMI "IIOS372"
#string STR_IODC_PROMPT_PORT_12            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS373"
#string STR_IODC_PROMPT_PORT_13            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS374"
#string STR_IODC_PROMPT_PORT_14            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS375"
#string STR_IODC_PROMPT_PORT_15            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS376"
#string STR_IODC_PROMPT_PORT_16            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS377"
#string STR_IODC_PROMPT_PORT_17            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS378"
#string STR_IODC_PROMPT_PORT_18            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS379"
#string STR_IODC_PROMPT_PORT_19            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS37A"
#string STR_IODC_PROMPT_PORT_20            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS37B"
#string STR_IODC_PROMPT_PORT_21           	#language en-US "IODC Configuration"
						#language x-AMI "IIOS37C"
#string STR_IODC_PROMPT_PORT_22            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS37D"
#string STR_IODC_PROMPT_PORT_23            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS37E"
#string STR_IODC_PROMPT_PORT_24            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS37F"
#string STR_IODC_PROMPT_PORT_25            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS380"
#string STR_IODC_PROMPT_PORT_26           	#language en-US "IODC Configuration"
						#language x-AMI "IIOS381"
#string STR_IODC_PROMPT_PORT_27            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS382"
#string STR_IODC_PROMPT_PORT_28            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS383"
#string STR_IODC_PROMPT_PORT_29            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS384"
#string STR_IODC_PROMPT_PORT_30            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS385"
#string STR_IODC_PROMPT_PORT_31            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS386"
#string STR_IODC_PROMPT_PORT_32            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS387"
#string STR_IODC_PROMPT_PORT_33            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS388"
#string STR_IODC_PROMPT_PORT_34            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS389"
#string STR_IODC_PROMPT_PORT_35            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS38A"
#string STR_IODC_PROMPT_PORT_36            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS38B"
#string STR_IODC_PROMPT_PORT_37            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS38C"
#string STR_IODC_PROMPT_PORT_38            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS38D"
#string STR_IODC_PROMPT_PORT_39            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS38E"
#string STR_IODC_PROMPT_PORT_40            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS38F"
#string STR_IODC_PROMPT_PORT_41            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS390"
#string STR_IODC_PROMPT_PORT_42            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS391"
#string STR_IODC_PROMPT_PORT_43            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS392"
#string STR_IODC_PROMPT_PORT_44            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS393"
#string STR_IODC_PROMPT_PORT_45            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS394"
#string STR_IODC_PROMPT_PORT_46            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS395"
#string STR_IODC_PROMPT_PORT_47            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS396"
#string STR_IODC_PROMPT_PORT_48            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS397"
#string STR_IODC_PROMPT_PORT_49            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS398"
#string STR_IODC_PROMPT_PORT_50            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS399"
#string STR_IODC_PROMPT_PORT_51            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS39A"
#string STR_IODC_PROMPT_PORT_52            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS39B"
#string STR_IODC_PROMPT_PORT_53            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS39C"
#string STR_IODC_PROMPT_PORT_54            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS39D"
#string STR_IODC_PROMPT_PORT_55            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS39E"
#string STR_IODC_PROMPT_PORT_56            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS39F"
#string STR_IODC_PROMPT_PORT_57            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A0"
#string STR_IODC_PROMPT_PORT_58            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A1"
#string STR_IODC_PROMPT_PORT_59            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A2"
#string STR_IODC_PROMPT_PORT_60           	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A3"
#string STR_IODC_PROMPT_PORT_61            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A4"
#string STR_IODC_PROMPT_PORT_62            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A5"
#string STR_IODC_PROMPT_PORT_63            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A6"
#string STR_IODC_PROMPT_PORT_64            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A7"
#string STR_IODC_PROMPT_PORT_65            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A8"
#string STR_IODC_PROMPT_PORT_66            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3A9"
#string STR_IODC_PROMPT_PORT_67            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3AA"
#string STR_IODC_PROMPT_PORT_68            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3AB"
#string STR_IODC_PROMPT_PORT_69            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3AC"
#string STR_IODC_PROMPT_PORT_70            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3AD"
#string STR_IODC_PROMPT_PORT_71            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3AE"
#string STR_IODC_PROMPT_PORT_72            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3AF"
#string STR_IODC_PROMPT_PORT_73            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B0"
#string STR_IODC_PROMPT_PORT_74            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B1"
#string STR_IODC_PROMPT_PORT_75            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B2"
#string STR_IODC_PROMPT_PORT_76            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B3"
#string STR_IODC_PROMPT_PORT_77            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B4"
#string STR_IODC_PROMPT_PORT_78            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B5"
#string STR_IODC_PROMPT_PORT_79            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B6"
#string STR_IODC_PROMPT_PORT_80           	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B7"
#string STR_IODC_PROMPT_PORT_81            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B8"
#string STR_IODC_PROMPT_PORT_82            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3B9"
#string STR_IODC_PROMPT_PORT_83            	#language en-US "IODC Configuration"
						#language x-AMI "IIOS3BA"

#string STR_PCIE_RELAXED_ORDERING_PROMPT                    #language x-AMI "IIOS001"

#string STR_PCIE_PHY_TEST_MODE_PROMPT                       #language x-AMI "IIOS002"

#string STR_IIO_COMPLETION_TIMEOUT_PROMPT           #language x-AMI "CSPPL034" //SMCPKG_SUPPORT
#string STR_PCIE_MCP0_PROMPT_0          #language x-AMI "SMCBL004" //SMCPKG_SUPPORT
#string STR_PCIE_MCP1_PROMPT_0          #language x-AMI "SMCBL005" //SMCPKG_SUPPORT
#string STR_PCIE_MCP0_PROMPT_1          #language x-AMI "SMCBL033" //SMCPKG_SUPPORT
#string STR_PCIE_MCP1_PROMPT_1          #language x-AMI "SMCBL034" //SMCPKG_SUPPORT

#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_0  #language x-AMI "SMCBL007" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_1  #language x-AMI "SMCBL009" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_2  #language x-AMI "SMCBL00B" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_3  #language x-AMI "SMCBL00D" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_4  #language x-AMI "SMCBL00F" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_5  #language x-AMI "SMCBL011" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_6  #language x-AMI "SMCBL013" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_7  #language x-AMI "SMCBL015" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_8  #language x-AMI "SMCBL017" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_9  #language x-AMI "SMCBL019" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_10  #language x-AMI "SMCBL01B" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_11  #language x-AMI "SMCBL01D" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_12  #language x-AMI "SMCBL01F" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_13  #language x-AMI "SMCBL021" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_14  #language x-AMI "SMCBL023" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_15  #language x-AMI "SMCBL025" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_16  #language x-AMI "SMCBL027" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_17  #language x-AMI "SMCBL029" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_18  #language x-AMI "SMCBL02B" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_19  #language x-AMI "SMCBL02D" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_20  #language x-AMI "SMCBL02F" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_21  #language x-AMI "SMCBL036" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_22  #language x-AMI "SMCBL038" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_23  #language x-AMI "SMCBL03A" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_24  #language x-AMI "SMCBL03C" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_25  #language x-AMI "SMCBL03E" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_26  #language x-AMI "SMCBL040" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_27  #language x-AMI "SMCBL042" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_28  #language x-AMI "SMCBL044" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_29  #language x-AMI "SMCBL046" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_30  #language x-AMI "SMCBL048" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_31  #language x-AMI "SMCBL04A" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_32  #language x-AMI "SMCBL04C" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_33  #language x-AMI "SMCBL04E" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_34  #language x-AMI "SMCBL050" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_35  #language x-AMI "SMCBL052" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_36  #language x-AMI "SMCBL054" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_37  #language x-AMI "SMCBL056" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_38  #language x-AMI "SMCBL058" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_39  #language x-AMI "SMCBL05A" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_40  #language x-AMI "SMCBL05C" //SMCPKG_SUPPORT
#string STR_PCIE_PORT_MAX_PAYLOAD_REQUEST_PROMPT_41  #language x-AMI "SMCBL05E" //SMCPKG_SUPPORT

#string STR_DISABLE_TPH_PROMPT                    #language x-AMI "CSPPL035" //SMCPKG_SUPPORT
#string STR_PRIORITIZE_TPH                       #language x-AMI "CSPPL036" //SMCPKG_SUPPORT
#string STR_CB_RELAXED_ORDERING_PROMPT                    #language x-AMI "CSPPL037" //SMCPKG_SUPPORT

#string STR_IIO_VTD_INT_REMAP_PROMPT    #language x-AMI "CSPPL039" //SMCPKG_SUPPORT
#string STR_IIO_VTD_PASSTHROUGH_DMA_PROMPT  #language x-AMI "CSPPL03A" //SMCPKG_SUPPORT
#string STR_IIO_VTD_ATS_PROMPT          #language x-AMI "CSPPL03B" //SMCPKG_SUPPORT
#string STR_IIO_VTD_POSTEDINTERRUPT_PROMPT  #language x-AMI "CSPPL03C" //SMCPKG_SUPPORT
#string STR_IIO_VTD_COHERENCY_PROMPT    #language x-AMI "CSPPL03D" //SMCPKG_SUPPORT
